Revit 2024 API
ConduitSizeSettings.AddSize Method
 Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void AddSize(
	string standardName,
	ConduitSize sizeInfo
)
Visual Basic
Public Sub AddSize ( _
	standardName As String, _
	sizeInfo As ConduitSize _
)
Visual C++
public:
void AddSize(
	String^ standardName,
	ConduitSize^ sizeInfo
)
Parameters
standardName
Type: System.String
 The conduit standard name.
sizeInfo
Type: Autodesk.Revit.DB.Electrical.ConduitSize
 The new ConduitSize to be added.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The conduit standard name does not exist. -or- The conduit size already exists.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The function is called during iterating the size set.
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace